Rails/Dosey Doe Team Project - Rails/code/app/views/admin/users/_form.html.haml

SELECT "roles".* FROM "roles"
---
          = f.label :role
          = f.collection_select :role_id, Role.all, :id, :name