Rails/Dosey Doe Team Project - Rails/code/app/controllers/users_controller.rb

  def checkout
    @tickets = current_or_guest_user.tickets.where(status: 'reserved')
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."user_id" = ? AND "tickets"."status" = ?  [["user_id", 9], ["status", "reserved"]]

  def purchases
    @tickets = current_or_guest_user.tickets.where(status: 'sold')
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."user_id" = ? AND "tickets"."status" = ?  [["user_id", 9], ["status", "sold"]]