Rails/Dosey Doe Team Project - Rails/code/app/controllers/venues_controller.rb

  def index
    @venues = Venue.all
---
SELECT "venues".* FROM "venues"

  def show
    @venue = Venue.find(params[:id])
    @shows = @venue.shows.page(params[:page])
---
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT 1  [["id", -1]]
SELECT  "shows".* FROM "shows" WHERE "shows"."venue_id" = ? LIMIT 7 OFFSET 0  [["venue_id", 1]]
SELECT COUNT(*) FROM "shows" WHERE "shows"."venue_id" = ?  [["venue_id", 1]]