Rails/Dosey Doe Team Project - Rails/code/app/views/admin/venues/show.html.haml

              %tbody
                -@venue.shows.each do |show|
---
SELECT "shows".* FROM "shows" WHERE "shows"."venue_id" = ?  [["venue_id", 1]]