Rails/Dosey Doe Team Project - Rails/code/app/views/admin/shows/show.html.haml

    %th.text-center Seats
    - @show.tickets.each do |ticket|
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."show_id" = ?  [["show_id", 1]]