Rails/Dosey Doe Team Project - Rails/code/app/controllers/admin/roles_controller.rb

SELECT "roles".* FROM "roles"
---
  def index
    @roles = Role.all

INSERT INTO "roles" ("name", "landing_page", "sell_tickets", "hold_seats", "issue_refunds", "view_reports", "view_customers", "view_admins", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @role = Role.new(role_params)

    if @role.save

UPDATE "roles" SET "view_admins" = ?, "view_customers" = ?, "updated_at" = ? WHERE "roles"."id" = ?  [["view_admins", "t"], ["view_customers", "t"], ["updated_at", "2015-05-06 03:27:16.719267"], ["id", 1]]
---
  def update
    if @role.update(role_params)

DELETE FROM "roles" WHERE "roles"."id" = ?  [["id", 1]]
---
  def destroy
    role_name = @role.name
    @role.destroy

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", 2]]
---
  def set_role
    @role = Role.find(params[:id])