Rails/Dosey Doe Team Project - Rails/code/app/controllers/admin/shows_controller.rb

SELECT "shows".* FROM "shows"  ORDER BY "shows"."show_date" ASC
---
  def index
    if params[:search]
      @shows = Show.where("artist like ?", "%#{params[:search]}%").order(:show_date)
    else
      @shows = Show.all.order(:show_date)

INSERT INTO "shows" ("venue_id", "show_date", "doors_open", "dinner_starts", "dinner_ends", "show_starts", "artist", "seating_chart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "seats".* FROM "seats" WHERE "seats"."seating_chart_id" = ?  [["seating_chart_id", 1]]
---
  def create
    @show = Show.new(show_params)

    if @show.save
      @show.seating_chart.seats.each do |seat|

UPDATE "shows" SET "show_date" = ?, "artist" = ?, "updated_at" = ? WHERE "shows"."id" = ?  [["show_date", "2015-05-10"], ["artist", "Enoch Schneider"], ["updated_at", "2015-05-06 03:43:20.489923"], ["id", 1]]
---
  def update
    if @show.update(show_params)

DELETE FROM "shows" WHERE "shows"."id" = ?  [["id", 1]]
---
  def destroy
    @show.destroy

SELECT  "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", -1]]
---
  def set_show
    begin
      @show = Show.find(params[:id])