Rails/Dosey Doe Team Project - Rails/code/app/controllers/admin/users_controller.rb

  def create
    if params.require(:user)[:type] == 'Admin'
      unless current_or_guest_user.role.view_admins
        redirect_to(admin_users_path, notice: 'You do not have create admin permissions') and return
      end
    end

    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("type", "email", "first_name", "last_name", "encrypted_password", "role_id", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update(update_user_params)
---
UPDATE "users" SET "email" = ?, "first_name" = ?, "last_name" = ?, "role_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "yazmin_hilpert@bashirianraynor.net"], ["first_name", "Koby"], ["last_name", "Hilpert"], ["role_id", 3], ["updated_at", "2015-05-06 03:27:10.269430"], ["id", 2]]

  def destroy
    if @user == current_or_guest_user
      @users = Admin.all
      redirect_to admin_admins_path, notice: 'You cannot delete yourself'
    elsif !@user.admin?
      @users = Customer.all
      redirect_to admin_customers_path, notice: 'You cannot delete a customer'
    else
      @user.destroy
---
DELETE FROM "users" WHERE "users"."type" IN ('Admin') AND "users"."id" = ?  [["id", 2]]

  def find_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]